In [1]:
import pymysql

In [2]:
%load_ext sql

In [4]:
%%sql
CREATE DATABASE cm_devices1;

 * mysql://root:***@localhost/mysql
1 rows affected.

[]

In [5]:
%%sql
USE cm_devices1;

 * mysql://root:***@localhost/mysql
0 rows affected.

[]

In [6]:
%%sql
CREATE TABLE invoice(
    customerID VARCHAR(50),
    orderDate DATE,
    quantity INT,
    price DECIMAL
);

 * mysql://root:***@localhost/mysql
0 rows affected.

[]

In [7]:
%%sql
CREATE TABLE address(
    id INT NOT NULL, 
    street VARCHAR(255), 
    postCode VARCHAR(10) DEFAULT "HA97DE",
    town VARCHAR(30) DEFAULT "Harrow"
);

 * mysql://root:***@localhost/mysql
0 rows affected.

[]

In [8]:
%%sql
CREATE TABLE customers(
    username CHAR(9),
    fullName VARCHAR(100), 
    email VARCHAR(255)
);

 * mysql://root:***@localhost/mysql
0 rows affected.

[]

In [9]:
%%sql
CREATE TABLE devices(
    deviceID INT,
    deviceName VARCHAR(50),
    price DECIMAL
);

 * mysql://root:***@localhost/mysql
0 rows affected.

[]

In [10]:
%%sql
CREATE TABLE account(
    accountNumber INT,
    phoneNumber INT,
    email VARCHAR(255)
);

 * mysql://root:***@localhost/mysql
0 rows affected.

[]

In [11]:
%%sql
show tables;

 * mysql://root:***@localhost/mysql
5 rows affected.

[('account',), ('address',), ('customers',), ('devices',), ('invoice',)]

In [12]:
%%sql
SHOW COLUMNS FROM invoice;

 * mysql://root:***@localhost/mysql
4 rows affected.

[('customerID', 'varchar(50)', 'YES', '', None, ''),
 ('orderDate', 'date', 'YES', '', None, ''),
 ('quantity', 'int', 'YES', '', None, ''),
 ('price', 'decimal(10,0)', 'YES', '', None, '')]

In [13]:
%%sql
CREATE DATABASE bookshop1;

 * mysql://root:***@localhost/mysql
1 rows affected.

[]

In [14]:
%%sql
USE bookshop1;

 * mysql://root:***@localhost/mysql
0 rows affected.

[]

In [15]:
%%sql
CREATE TABLE customers(
    customerID int,
    customerName varchar(50),
    customerAddress varchar(255)
);

 * mysql://root:***@localhost/mysql
0 rows affected.

[]

In [16]:
%%sql
SHOW TABLES;

 * mysql://root:***@localhost/mysql
1 rows affected.

[('customers',)]

In [17]:
%%sql
INSERT INTO customers(
    customerID,
    customerName,
    customerAddress
)
VALUES
(1, "Jack", "115 Old street Belfast"),
(2, "James", "24 Carlson Rd London");

 * mysql://root:***@localhost/mysql
2 rows affected.

[]

In [18]:
%%sql
SELECT * FROM customers;

 * mysql://root:***@localhost/mysql
2 rows affected.

[(1, 'Jack', '115 Old street Belfast'), (2, 'James', '24 Carlson Rd London')]

In [19]:
%%sql
TRUNCATE TABLE customers;

 * mysql://root:***@localhost/mysql
0 rows affected.

[]

In [20]:
%%sql
INSERT INTO `customers` (
    `customerID`,
    `customerName`,
    `customerAddress`)
VALUES
(1, 'Jack', '115 Old street Belfast'),
(2, 'James', '24 Carlson Rd London'),
(4, 'Maria', '5 Fredrik Rd, Bedford'),
(5, 'Jade', '10 Copland Ave Portsmouth '),
(6, 'Yasmine', '15 Fredrik Rd, Bedford'),
(3, 'Jimmy', '110 Copland Ave Portsmouth');

 * mysql://root:***@localhost/mysql
6 rows affected.

[]

In [21]:
%%sql
DELETE FROM customers 
WHERE customerID = 3;

 * mysql://root:***@localhost/mysql
1 rows affected.

[]

In [22]:
%%sql
SELECT * FROM customers;

 * mysql://root:***@localhost/mysql
5 rows affected.

[(1, 'Jack', '115 Old street Belfast'),
 (2, 'James', '24 Carlson Rd London'),
 (4, 'Maria', '5 Fredrik Rd, Bedford'),
 (5, 'Jade', '10 Copland Ave Portsmouth '),
 (6, 'Yasmine', '15 Fredrik Rd, Bedford')]

In [23]:
%%sql
CREATE DATABASE Chinook1;

 * mysql://root:***@localhost/mysql
1 rows affected.

[]

In [24]:
%%sql
USE Chinook1;

 * mysql://root:***@localhost/mysql
0 rows affected.

[]

In [25]:
%%sql
CREATE TABLE Customer(
    CustomerId int,
    FirstName varchar(50),
    LastName varchar(50),
    Company varchar(100),
    Address varchar(50),
    City varchar(50),
    State varchar(50),
    Country varchar(50),
    PostalCode varchar(50),
    Phone varchar(50),
    Fax varchar(100),
    Email varchar(100),
    SupportRepId int
);

 * mysql://root:***@localhost/mysql
0 rows affected.

[]

In [26]:
%%sql
INSERT INTO Customer (
    CustomerId,
    FirstName,
    LastName, 
    Company,
    Address,
    City,
    State,
    Country,
    PostalCode,
    Phone,
    Fax,
    Email,
    SupportRepId)
VALUES 
(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3);

 * mysql://root:***@localhost/mysql
1 rows affected.

[]

In [27]:
%%sql
INSERT INTO Customer (CustomerId, FirstName, LastName, Company, Address, City, State, Country, PostalCode, Phone, Fax, Email, SupportRepId) VALUES (2, 'Eduardo', 'Martins', 'Woodstock Discos', 'Rua Dr. Falcão Filho, 155', 'São Paulo', 'SP', 'Brazil', '01007-010', '+55 (11) 3033-5446', '+55 (11) 3033-4564', 'eduardo@woodstock.com.br', 4);

 * mysql://root:***@localhost/mysql
1 rows affected.

[]

In [28]:
%%sql
INSERT INTO Customer (CustomerId, FirstName, LastName, Company, Address, City, State, Country, PostalCode, Phone, Fax, Email, SupportRepId) VALUES (3, 'Alexandre', 'Rocha', 'Banco do Brasil S.A.', 'Av. Paulista, 2022', 'São Paulo', 'SP', 'Brazil', '01310-200', '+55 (11) 3055-3278', '+55 (11) 3055-8131', 'alero@uol.com.br', 5);

 * mysql://root:***@localhost/mysql
1 rows affected.

[]

In [29]:
%%sql
INSERT INTO Customer (CustomerId, FirstName, LastName, Company, Address, City, State, Country, PostalCode, Phone, Fax, Email, SupportRepId) VALUES (4, 'Roberto', 'Almeida', 'Riotur', 'Praça Pio X, 119', 'Rio de Janeiro', 'RJ', 'Brazil', '20040-020', '+55 (21) 2271-7000', '+55 (21) 2271-7070', 'roberto.almeida@riotur.gov.br', 3);

 * mysql://root:***@localhost/mysql
1 rows affected.

[]

In [30]:
%%sql
INSERT INTO Customer (CustomerId, FirstName, LastName, Company, Address, City, State, Country, PostalCode, Phone, Fax, Email, SupportRepId) VALUES (5, 'Mark', 'Philips', 'Telus', '8210 111 ST NW', 'Edmonton', 'AB', 'Canada', 'T6G 2C7', '+1 (780) 434-4554', '+1 (780) 434-5565', 'mphilips12@shaw.ca', 5);

 * mysql://root:***@localhost/mysql
1 rows affected.

[]

In [31]:
%%sql
INSERT INTO Customer (CustomerId, FirstName, LastName, Company, Address, City, State, Country, PostalCode, Phone, Fax, Email, SupportRepId) VALUES (6, 'Jennifer', 'Peterson', 'Rogers Canada', '700 W Pender Street', 'Vancouver', 'BC', 'Canada', 'V6C 1G8', '+1 (604) 688-2255', '+1 (604) 688-8756', 'jenniferp@rogers.ca', 3);

 * mysql://root:***@localhost/mysql
1 rows affected.

[]

In [32]:
%%sql
SELECT CustomerID, FirstName, LastName, City, State, Country
FROM Customer
WHERE Country = 'Brazil'
ORDER BY FirstName;

 * mysql://root:***@localhost/mysql
4 rows affected.

[(3, 'Alexandre', 'Rocha', 'São Paulo', 'SP', 'Brazil'),
 (2, 'Eduardo', 'Martins', 'São Paulo', 'SP', 'Brazil'),
 (1, 'Luís', 'Gonçalves', 'São José dos Campos', 'SP', 'Brazil'),
 (4, 'Roberto', 'Almeida', 'Rio de Janeiro', 'RJ', 'Brazil')]

In [33]:
%%sql
SELECT FirstName, Country 
FROM Customer
WHERE Country = 'Canada'
ORDER BY FirstName;

 * mysql://root:***@localhost/mysql
2 rows affected.

[('Jennifer', 'Canada'), ('Mark', 'Canada')]

In [35]:
%%sql
CREATE DATABASE restaurant1;

 * mysql://root:***@localhost/mysql
1 rows affected.

[]

In [37]:
%%sql
USE restaurant1;

 * mysql://root:***@localhost/mysql
0 rows affected.

[]

In [38]:
%%sql
CREATE TABLE tbl(
    table_id INT,
    location VARCHAR(255),
    PRIMARY KEY (table_id)
);

 * mysql://root:***@localhost/mysql
0 rows affected.

[]

In [39]:
%%sql
CREATE TABLE waiter(
    waiter_id INT,
    name VARCHAR(150),
    contact_no VARCHAR(10),
    shift VARCHAR(10),
    PRIMARY KEY (waiter_id)
);

 * mysql://root:***@localhost/mysql
0 rows affected.

[]

In [40]:
%%sql
CREATE TABLE table_order(
    order_id INT,
    date_time DATETIME,
    table_id INT,
    waiter_id INT,
    PRIMARY KEY (order_id),
    FOREIGN KEY (table_id) REFERENCES tbl(table_id),
    FOREIGN KEY (waiter_id) REFERENCES waiter(waiter_id)
);

 * mysql://root:***@localhost/mysql
0 rows affected.

[]

In [41]:
%%sql
CREATE TABLE customer( 
    customer_id INT,
    name VARCHAR(100),
    NIC_no VARCHAR(12),
    contact_no VARCHAR(10),
    PRIMARY KEY (customer_id) 
);

 * mysql://root:***@localhost/mysql
0 rows affected.

[]

In [42]:
%%sql
CREATE TABLE reservation(
    reservation_id INT,
    date_time DATETIME,
    no_of_pax INT,
    order_id INT,
    table_id INT,
    customer_id INT,
    PRIMARY KEY (reservation_id),
    FOREIGN KEY (order_id) REFERENCES table_order(table_id),
    FOREIGN KEY (table_id) REFERENCES tbl(table_id),
    FOREIGN KEY (customer_id) REFERENCES customer(customer_id) 
);

 * mysql://root:***@localhost/mysql
0 rows affected.

[]

In [43]:
%%sql
CREATE TABLE menu(
    menu_id INT,
    description VARCHAR(255),
    availability INT,
    PRIMARY KEY (menu_id) 
);

 * mysql://root:***@localhost/mysql
0 rows affected.

[]

In [44]:
%%sql
CREATE TABLE menu_item(
    menu_item_id INT,
    description VARCHAR(255),
    price FLOAT,
    availability INT,
    menu_id INT,
    PRIMARY KEY (menu_item_id),
    FOREIGN KEY (menu_id) REFERENCES menu(menu_id) 
);

 * mysql://root:***@localhost/mysql
0 rows affected.

[]

In [45]:
%%sql
CREATE TABLE order_menu_item(
    order_id INT,
    menu_item_id INT,
    quantity INT,
    PRIMARY KEY (order_id,menu_item_id),
    FOREIGN KEY (order_id) REFERENCES table_order(order_id),
    FOREIGN KEY (menu_item_id) REFERENCES menu_item(menu_item_id) 
);

 * mysql://root:***@localhost/mysql
0 rows affected.

[]

In [46]:
%%sql
CREATE DATABASE automobile1;

 * mysql://root:***@localhost/mysql
1 rows affected.

[]

In [48]:
%%sql
USE automobile1;

 * mysql://root:***@localhost/mysql
0 rows affected.

[]

In [49]:
%%sql
CREATE TABLE vehicle(
    vehicleID VARCHAR(10),
    ownerID VARCHAR(10),
    plateNumber VARCHAR(10),
    phoneNumber INT,
    PRIMARY KEY (vehicleID)
);

 * mysql://root:***@localhost/mysql
0 rows affected.

[]

In [50]:
%%sql
SHOW COLUMNS FROM vehicle;

 * mysql://root:***@localhost/mysql
4 rows affected.

[('vehicleID', 'varchar(10)', 'NO', 'PRI', None, ''),
 ('ownerID', 'varchar(10)', 'YES', '', None, ''),
 ('plateNumber', 'varchar(10)', 'YES', '', None, ''),
 ('phoneNumber', 'int', 'YES', '', None, '')]

In [51]:
%%sql
CREATE TABLE Owner(
    ownerID VARCHAR(10),
    ownerName VARCHAR(50),
    ownerAddress VARCHAR(255),
    PRIMARY KEY (ownerID)
);

 * mysql://root:***@localhost/mysql
0 rows affected.

[]

In [52]:
%%sql
ALTER TABLE vehicle 
ADD FOREIGN KEY (ownerID) REFERENCES Owner (ownerID);

 * mysql://root:***@localhost/mysql
0 rows affected.

[]

In [53]:
%%sql
SHOW COLUMNS FROM vehicle;

 * mysql://root:***@localhost/mysql
4 rows affected.

[('vehicleID', 'varchar(10)', 'NO', 'PRI', None, ''),
 ('ownerID', 'varchar(10)', 'YES', 'MUL', None, ''),
 ('plateNumber', 'varchar(10)', 'YES', '', None, ''),
 ('phoneNumber', 'int', 'YES', '', None, '')]